Show / Hide Table of Contents
Class LineSegment2D
Represents a line segment in two-dimensional space.
Inheritance
System.Object
OpenObject
Segment2D
LineSegment2D
Inherited Members
 Segment2D.EndPoint
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry2D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Geometry2D.LineSegment2D,CI.Geometry2D")]
public class LineSegment2D : Segment2D
 Improve this Doc
 View Source